group-reports/shahriar-1-2-tests/results-after-queue/disk-throughput-tuning-protocol-B/test-4.txt
write-randomly-test-job: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
write-randomly-test-job: Laying out IO file (1 file / 10240MiB)

write-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=27577: Tue Jul 11 02:17:20 2023
  write: IOPS=165, BW=1328KiB/s (1360kB/s)(779MiB/600674msec)
    slat (usec): min=4, max=1637.3k, avg=95331.86, stdev=203246.47
    clat (msec): min=18, max=5341, avg=1445.53, stdev=695.73
     lat (msec): min=18, max=5727, avg=1540.87, stdev=719.07
    clat percentiles (msec):
     |  1.00th=[  296],  5.00th=[  430], 10.00th=[  642], 20.00th=[  827],
     | 30.00th=[ 1028], 40.00th=[ 1200], 50.00th=[ 1351], 60.00th=[ 1536],
     | 70.00th=[ 1737], 80.00th=[ 1989], 90.00th=[ 2366], 95.00th=[ 2702],
     | 99.00th=[ 3440], 99.50th=[ 3775], 99.90th=[ 4396], 99.95th=[ 4597],
     | 99.99th=[ 5000]
   bw (  KiB/s): min=   15, max=  495, per=7.01%, avg=93.03, stdev=65.96, samples=17088
   iops        : min=    1, max=   61, avg=11.54, stdev= 8.25, samples=17088
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.29%, 500=6.39%
  lat (msec)   : 750=8.40%, 1000=13.56%
  cpu          : usr=0.01%, sys=0.04%, ctx=396955, majf=0, minf=135
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,99710,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=1328KiB/s (1360kB/s), 1328KiB/s-1328KiB/s (1360kB/s-1360kB/s), io=779MiB (817MB), run=600674-600674msec

Disk stats (read/write):
    drbd1: ios=0/100120, merge=0/0, ticks=0/56035376, in_queue=56035376, util=99.18%, aggrios=1625/100512, aggrmerge=0/0, aggrticks=7935/17338435, aggrin_queue=17346370, aggrutil=85.23%
    dm-0: ios=1625/100512, merge=0/0, ticks=7935/17338435, in_queue=17346370, util=85.23%, aggrios=1538/100510, aggrmerge=146/2, aggrticks=13828/17338521, aggrin_queue=17301486, aggrutil=85.24%
  vdb: ios=1538/100510, merge=146/2, ticks=13828/17338521, in_queue=17301486, util=85.24%